Catalogs/Контрагенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Catalog>
		<Properties>
			<Name>Контрагенты</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/А1Бух_Контрагенты/Ext/Module.bsl
#Если НЕ Клиент Тогда
	
	Функция ПоИННКПП(ИНН, КПП) Экспорт
		Если НЕ ЗначениеЗаполнено(ИНН) Или НЕ ЗначениеЗаполнено(КПП) Тогда
			Возврат Неопределено;
		КонецЕсли;
		СтруктураПоиска = Новый Структура("ИНН,КПП", А1Э_Строки.Встроку(ИНН), А1Э_Строки.ВСтроку(КПП));
		Запрос = А1Э_Запросы.Запрос(
		"ВЫБРАТЬ
		|	Контрагенты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.ИНН = &ИНН
		|	И Контрагенты.КПП = &КПП",
		СтруктураПоиска);
		Результат = Запрос.Выполнить();
		Если Результат.Пустой() Тогда
			Возврат Справочники.Контрагенты.ПустаяСсылка();
		КонецЕсли;
		Таблица = Результат.Выгрузить();
		Если Таблица.Количество() > 1 Тогда
			Сообщить("Обнаружены дубли контрагентов с ИНН " + ИНН + " и КПП " + КПП + "!");
		КонецЕсли;
		Возврат Таблица[0].Ссылка;
	КонецФункции 
	
#КонецЕсли

// Возвращает полное наименование с разверткой аббревиатур ООО, АО и прочих.
//
// Параметры:
//  Данные	 - Справочник.Контрагенты,Строка - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПравильноеПолноеНаименование(ДанныеНаименованияКонтрагента) Экспорт
	Если ТипЗнч(ДанныеНаименованияКонтрагента) = Тип("Строка") Тогда
		ПолноеНаименование = ДанныеНаименованияКонтрагента;
	Иначе
		//Это СправочникСсылка или СправочникОбъект 
		ПолноеНаименование = ДанныеНаименованияКонтрагента.ПолноеНаименование
	КонецЕсли;
	
	А1Э_Строки.Подставить(ПолноеНаименование, "ООО ", "Общество с ограниченной ответственностью ");
	А1Э_Строки.Подставить(ПолноеНаименование, "АО ", "Акционерное общество ");
	А1Э_Строки.Подставить(ПолноеНаименование, "ЗАО ", "Закрытое акционерное общество ");
	
	Возврат ПолноеНаименование;
КонецФункции 
 
// Возвращает полное наименование
//
// Параметры:
//  ДанныеНаименованияКонтрагента	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПредставлениеДляДоговора(ДанныеНаименованияКонтрагента) Экспорт
	Если ТипЗнч(ДанныеНаименованияКонтрагента) = Тип("Строка") Тогда
		ПолноеНаименование = ДанныеНаименованияКонтрагента;
	Иначе
		//Это СправочникСсылка или СправочникОбъект 
		ПолноеНаименование = ДанныеНаименованияКонтрагента.НаименованиеПолное;
	КонецЕсли;
	
	Возврат ПравильноеПолноеНаименование(ПолноеНаименование) + " (" + ПолноеНаименование + ")"; 
КонецФункции
